[
    {
        "stock": ["A17U", "AJBU", "C31", "D05", "BN4"],
        "title": "[Funding Alert] ION Mobility Raises USD 3.3 Million Seed Round To Launch Smart Electric Motorbikes",
        "summary": "Funding will be used to launch electric motorbikes in Southeast Asia, expand market presence and develop its R&D supply chain and manufacturing capabilities",
        "content": "ION Mobility has raised USD 3.3 million in seed funding. Notable investors in the round include Monk’s Hill Ventures, TNB Aura, Village Global, kipleX and Seeds Capital. “There is no proven EV (electric vehicle) motorbike brand in Southeast Asia with products that can compel motorbike riders to join the inevitable electric revolution,” co-founder and Chief Executive Officer James Chan said. “We are committed to offering riders across Southeast Asia superior alternatives to their petrol-based motorbikes with our next-generation, smart and connected electric motorbikes that are clean, aspirational and affordable.” “Southeast Asia has one of the largest and fastest growing numbers of motorbike users in the world. With a rising middle class and newer generation of riders craving for affordable, cleaner and relatable motorbikes, ION Mobility is poised to combine technical performance, modern design, and mobile connectivity to the masses. We are excited to be working with James and Joel - representing a rare combination of technical, domain and market know-how - in creating the next iconic startup to emerge from Southeast Asia,” said Monk’s Hill Ventures co-founder and managing partner Kuo-Yi Lim. The market opportunity for the motorbike industry in Southeast Asia is expected to hit USD 8.53 billion by 2023. The establishment enters the market focusing on Indonesia which has one of the biggest motorbike markets globally, with 2019 motorcycle sales in Indonesia at 6.38 million units a year. It plans to launch its first EV motorbike in Indonesia in 2021. In addition, the company is set to expand its team and operations across Singapore, Jakarta and Shenzhen, develop its in-house research and development capabilities, and build up its supply chain and manufacturing partnerships. \"We at TNB Aura believe that the emergence of a local OEM (original equipment manufacturer) champion is both necessary and imminent, with Southeast Asia representing 8 per cent of the world population yet 25 per cent of global motorbike demand. We are excited to be supporting strong repeat entrepreneurs James and Joel in bringing a home-grown mainstream EV motorbike offering to the market, starting with Indonesia. Through pushing the boundaries of advanced manufacturing and design, we believe the ION Mobility team is uniquely positioned to take on this enormous opportunity,\" commented TNB Aura co-founder and managing partner Charles Wong. The company aims to convert over 200 million motorcycle users in Southeast Asia from petrol to electric to drive a sustainable future."
    },
    {
        "stock": ["Z74", "Y92", "J37", "S58", "S63", "S68"],
        "title": "How to Get Your PPP Loan Forgiven",
        "summary": "Join our experts Mark J. Kohler and Mat Sorensen as they take you through the ins and outs of the SBA's 1-page PPP forgiveness application for loans.",
        "content": "The Small Business Administration (SBA) has released a simple 1-page forgiveness application for Paycheck Protection Program (PPP) borrowers who obtained loans of $50,000 or less. The new application removes calculations required on prior forms and simplifies documentation requirements. Join us in this live webinar, as our key experts Mark J. Kohler and Mat Sorensen, nationally respected tax lawyers, take you through the ins and outs of the SBA's 1-page PPP forgiveness application for loans. Mark and Mat will dive into: How documentation requirements have changed Who can and cannot use the new simplified application Processing-procedure timeline for PPP forgiveness application' Register Now Entrepreneur Press author Mark J. Kohler, CPA, attorney, co-host of the Podcast “Refresh Your Wealth”, and a senior partner at both the law firm KKOS Lawyers and the accounting firm K&E CPAs. Kohler is also the author of “The Tax and Legal Playbook, 2nd Edition”, and “The Business Owner’s Guide to Financial Freedom. Mat Sorensen is an attorney, CEO, author, and podcast host. He is the CEO of Directed IRA & Directed Trust Company, a leading company in the self-directed IRA and 401k industry and a partner in the business and tax law firm of KKOS Lawyers. He is the author of The Self-Directed IRA Handbook."
    },
    {
        "stock": ["C52", "J36", "N2IU", "U11"],
        "title": "18 Side Hustles That Can Help You Turn a Profit in 2020",
        "summary": "Need extra money right now? These side gigs might be able to provide",
        "content": "Even if you have a full-time job, there’s nothing wrong with putting a little extra cash in your pocket. It’s not about greed: Having an additional income stream means that you get out of debt or fatten your savings. But, there’s another possible outcome. You may be able to make this into a bonafide full-time job. That means you can be your own boss or generate a passive income. If you never thought about this before, 2020 should have opened your eyes — especially if you’re struggling as a business owner or have unfortunately lost your main source of income. The Covid-19 pandemic has shown that life can drastically change in the blink of an eye. As such, it makes sense that you have a financial safety-blanket so that you can weather whatever life throws your way. While the world has definitely changed, there are still ways that you can make extra money. You may even discover the next great business idea during this difficult time. If you need some ideas, then here are 20 suggestions for your side-hustle consideration. Related: 4 Tips for Discovering a Great Business Idea During the Pandemic 1. Deliver food Even prior to Covid-19, delivering food was one of the most popular side hustles. The reason? Third-parties like UberEats and DoorDash have allowed more restaurants to offer takeout. Another perk? The schedules are flexible with peak times being during lunch, dinner rushes and Sundays. And some people have claimed that they’ve made on average $18 an hour. Besides third-party apps, you could contact local eateries, like pizzerias, to see if they’re in need of part-time drivers. 2. Shop for others Similarly, you may also consider shopping for others. Instacart is one of the most popular examples of this. Just sign up and work whenever you have the availability. Best of all? You have the option to be only a shopper or to shop and deliver groceries. Instacart not available in your area? Then check out alternative services like Shipt. 3. Flex your Amazon muscles According to Statista, Amazon captured 45 percent of all U.S. ecommerce spending in 2019. That figure was expected to rise to 47 percent in 2020, but I suspect that will higher for obvious reasons. As such, Jeff Bezos and Co. need people to deliver these products. And that’s exactly what Amazon Flex is for. Just like with ride sharing or delivering food, you use your own vehicle. You can also set your own schedule, and Amazon claims that drivers make between $18 to $25 per hour. 4. Hop like a (Task)rabbit Are you handy around the house? Can you assemble that tricky IKEA furniture, set up smart devices, mount TVs or fix simple plumbing or electrical issues? If so, you can sell these skills on TaskRabbit or similar sites like Handy. Other services you can offer would be delivering groceries, helping people move, painting or yard work. Depending on where you reside, the task you’re performing, and flexibility, it’s possible to earn more than $2,000 per week. 5. Uber or Lyft driver If your vehicle meets the requirements and you don’t mind taxiing people around, this is one of the most common side gigs. Mainly because you can do this whenever and wherever you want. Plus, it’s feasible to rake in over a grand each month in supplemental income. At the same time, Covid may have impacted this side business depending on where you live. You might even have health concerns. If that’s the case, then you can still make money off your vehicle by renting it to others through Turo or Getaround. Some have reported that they’ve been able to make between $500 to $1000 renting out their vehicles."
    },
    {
        "stock": ["ME8U", "M44U", "C38U", "C61U", "AJBU", "A17U", "N2IU"],
        "title": "7 Things Restaurant Entrepreneurs Must Do to Survive and Thrive During the Great Pandemic Depression",
        "summary": "Proven tactics that have helped restaurants stay open and even prosper during the industry's most challenging time.",
        "content": "The Great Pandemic Depression has taught us that there are two nonessential things that our society can’t live without: toilet paper and restaurants.  Both were not considered survival essentials in my The Survival of the Richest book (2016); that is, we can technically live without them.  Yet, at the beginning of the quarantine, there were actual fights over toilet paper in supermarkets all over the world. Where toilet paper takes the cake for products, restaurants are the winners in the service industry.  With the new heavy governmental restrictions in place to combat Covid-19, our society has come to realize how dependent we are on restaurants to serve us food.  But we don’t need restaurants to survive—we have been cooking our own food since humans learned how to make fire.  Actually, dining at restaurants by the masses is a modern phenomenon.  For an interesting read on the history of restaurants, please visit When Did People Start Eating in Restaurants? by Dave Roos of History.com. Related: Ruby Tuesday Files for Bankruptcy After Closing Dozens of Locations in 2020 Although there have been so many restaurants that have went out of business in the past few months, there are some that have pivoted and are prospering better than ever.  However, I would guess that the majority of small entrepreneurial businesses that are still open are hanging in there by a thread. If you are a restaurant entrepreneur, here are seven ways that you can fight to stay alive and thrive. 1.  Ensure that your business is \"Covid Clean\" In the Pre-Covid-19 environment, cleanliness was always a priority for the average customer.  There are very few people who would encourage the cook to pile dirt on their burger. If the slightest hair was found in someone’s food, the customer usually expected to have their meal comped. What is Covid Clean? Covid Clean means the highest levels of cleanliness of the old restaurant standards applied exponentially. To accommodate the Covid Customer, you must understand the expectations and fears that they bring with them. You can make good money if you can demonstrate that you have raised the bar on cleanliness to the point where customers should have the same amount of risk or less of catching the virus in your restaurant as in their own home. Sparkling floors, sanitized kitchens, the best air filtration systems with top of the line filters replaced often, masks worn by all employees, plastic barriers where needed, tables seated at least six feet from each other, hand sanitizer stations, and the strictest hygiene requirements for all workers — this is Covid Clean. If you can hand deliver it, you will be miles ahead of the competition and can make serious money."
    },
    {
        "stock": ["A17U", "AJBU", "D05", "C31", "D01"],
        "title": "[Funding Alert] GoGet Raises USD 2 Mn In Series A Led By Monk's Hill Ventures",
        "summary": "The funding will be used to scale the startup's services in Malaysia through product development, and building and expanding its product as well as technology teams",
        "content": "GoGet announced on Tuesday that it has closed a Series A round of USD 2 million led by Monk’s Hill Ventures. The platform connects multinational corporations, small and medium enterprises, and business owners to verified flexible workers who are also called GoGetters. It will also expand its sales and digital marketing teams to grow user acquisition. “The traditional labor market is inefficient during these challenging times. Businesses especially SMEs need to find innovative ways to cut costs while being profitable. Our robust technology provides these businesses a cost-efficient solution beyond what a traditional job matching service can provide. This includes quality control, compliance to standards, good user experience, and workflow integration,” said Francesca Chia, chief executive officer and co-founder, GoGet. “Our vision is to build a sustainable future of work by empowering both businesses and gig economy workers in ASEAN. We also believe that by addressing the gaps in protection for flexible workers, it is making flexible work sustainable for our future.” The startup has created USD 5 million in value of jobs and helped over 20,000 GoGetters and over 5,000 businesses from small to large to scale up operationally without incurring full-time costs. All GoGetters are verified and trained using the platform before they start claiming jobs. Companies including Lazada Malaysia, IKEA Malaysia, Foodpanda and Bloomthis are using GoGetters for regular tasks including delivery, packing, and event support. “We partnered with GoGet on one of Lazada’s initiatives during Malaysia’s Movement Control Order in March. Leveraging their platform which includes Gogetters, logistics and technology capabilities, we were able to quickly onboard and help agricultural-based businesses who were severely impacted by the pandemic to deliver thousands of fresh produce which would have otherwise been thrown away,” said Shah Suriye Rubhen, COO, Lazada Malaysia. GoGet has also introduced gamification to upskill from basic skills to promoter skills and increase utilization of their GoGetters. The company also plans to open its platform for companies to utilize their technology to manage and digitize manual processes in their workforce. “The nature of work is being redefined as companies and workers seek both flexibility and fit. This trend has been accelerated by the pandemic, as businesses are transforming in response and require more elastic workforce. GoGet provides a community of motivated and well-trained workers, but more importantly, its platform extends the corporate people management systems to ensure quality, compliance and seamless workflow,” said Kuo-Yi Lim, co-founder and managing partner, Monk’s Hill Ventures."
    },
    {
        "stock": ["Z74", "Y92", "U96", "O39", "J37"],
        "title": "How to be a hero with the super power to make a lot of money",
        "summary": "Identify which are the villains and kryptonites in your portfolio to become a financial superhero.",
        "content": "Have you ever identified with a superhero ? Perhaps, with his strength, his intelligence, his speed, his speed, etc. Even as a child you probably dreamed of being a superhero, however, as the years go by, we lose that illusion and we realize that these things only exist in movies. But have you ever thought that you have the possibility of being another kind of hero? How about a hero who has the super power to make a lot of money? Yes, something like a financial superhero . I mean when you generate wealth from who you really are, from your financial superpowers, it is when your chances of success increase significantly and you feel that nothing can stop you. To know more: Some lessons that this bittersweet 2020 has left us When you are in control of your financial life, and that gives you a feeling of unmatched tranquility because you are prepared to face any adversity that the environment may bring. You are protected, and that gives you the feeling of great personal power, even fulfillment. And how can you work towards becoming a financial superhero? First of all, you should work on identifying some of these points that I share with you below:"
    },
    {
        "stock": ["C31", "C61U", "J37", "D05", "H78"],
        "title": "Here's How to Calculate the True Value of Your Time",
        "summary": "Don't limit yourself to selling hours -- there's a better way to discover what your time is worth.",
        "content": "In business, if you’ve heard it once, then you’ve heard it a thousand times — time is money. But just how much money? If you’re freelancing or consulting, how do you figure out just what you’re worth to other people? Related: 3 Ways to Figure out the Value of Your Time as an Entrepreneur The alternative to the comparative, hourly default To start, you might be tempted to just use a per-hour rate. You might look at what others make for similar work to set that rate for yourself. However, this isn’t a great solution. You’ll quickly hit a ceiling in terms of production, because there are only so many hours in a day to do the real work and all the un-billable, behind-the-scenes tasks involved like marketing. And let’s not forget that some clients like paying only a flat fee based on whether you finish a specific task, and that some projects will vary widely in terms of what’s required of you. To accommodate different situations and make sure you don’t limit yourself to only selling your hours, you want to focus instead on finding something that’s both scalable and in fantastic demand by a huge number of people. For example, I once did an analysis that looked at billionaires and how they’re distributed — this showed that the biggest wealth or demand areas are housing, clothing, food, energy and computers. Now, the products or services within those areas might look very different in the future. But those basic categories aren’t going anywhere. So, find a niche within these groups where you can scale and scale and scale — the cloud is a great example. As you keep scaling up over time and your sales increase, your monetary value will get higher, too. And, to find that value at any given point along the way, all you have to do is divide your earnings by how much billable time you’ve put in. Let’s look at an example. Let’s say you’re the CEO of Company Awesome. You’re pulling in $100,000 a year. And let’s assume that you’re lucky to get 1,000 billable hours per year out of the 2,000 you could work. Doing the math ($100,000/1,000 hours) means you’re worth $100 per hour. Similarly, if you’re running a $200 million company and get in 1,200 billable hours, then your value is $200 million/1,200, which is a cool $166,666 per hour. Every minute counts Now, let’s step back for a second. Yes, this simple formula lets you figure out what you could stand to earn. That’s great for financial planning and living the way you want. But the bigger lesson is that every minute counts. When you understand what the true monetary value of your time is, you’re not going to waste the hours of your day. It’s easier to see that fooling around or being inefficient really does cost you, and that it’s monetarily beneficial to be as professional as possible."
    },
    {
        "stock": ["M44U", "G13", "F34", "C07"],
        "title": "4 Reasons Why It's Time to Hire an Accountant for Your Small Business",
        "summary": "Only 30 percent of small business owners use one, but that's a mistake.",
        "content": "According to the 2019 Onpay Small Business Finance and HR Report, just 30 percent of small business owners work with accountants. That’s not surprising, given how much each dollar counts to a small company. Doing the accounting yourself certainly saves some money in the short term. That said, it might be worth hiring an outside accountant for your company. You, of course, have to weigh the pros and cons yourself, and each business is different, but there is much to be gained by bringing in an outside resource. Here are four reasons why you should consider hiring an accountant for your small business: Related: 7 Tasks You Do Every Day That Waste Time and Cost Your Business Money 1. It will save you time and stress down the road The Onpay study above found that 28 percent of small businesses have been audited by or received a formal notice from the IRS. I’ve seen friends go through audits at their companies and can say with certainty that it can be a nightmare. Just the notice itself can create anxiety over whether you made mistakes. But even if you did everything correctly, you’ll still spend hours preparing to demonstrate that and have to deal with all the anxiety that comes with the experience. Having an accountant will eliminate this worry and free up your time, giving you someone to take that burden off your shoulders. "
    },
    {
        "stock": ["G13", "C6L", "C52"],
        "title": "Accounts Receivable Financing, An Option for Businesses in Times of COVID-19",
        "summary": "While good liquidity is a vital weapon in the face of the crisis, access to working capital is becoming increasingly complex; accounts receivable financing stands out as a solution to this challenge.",
        "content": "Despite the fact that the economic reopening has started, the uncertainty, as well as the scope and duration of the crisis, are still a question for companies in the country and the world. Given this, consultants and specialists emphasize that the best way to prepare to face it is to understand what its risks and vulnerability are from an operational and financial point of view. With this in mind, an effective level of liquidity and strategies related to cash flow management stand out as the main advice from the experts. You may be interested: If you are owed and not paid, apply these 4 steps to speed up your collection But, while, in the last quarter of 2020, investment, consumption and exports in Mexico report the strongest falls in the records of the National Institute of Statistics and Geography (Inegi) , the natural question is, How can companies improve their finances? The immediate answer is financing. However, another challenge arises. Photo: Micheile Henderson via Unsplash The conditions for both access and loan application during the last quarters of the year have also been significantly affected : not only is it that companies demand fewer credits due to the concern of not being able to meet the obligation of a debt, but banks and financial institutions have become stricter in the conditions and standards of approval. This does not mean that financing is completely ruled out, as there are still other ways to finance your operations without acquiring more debt. Reduce inventory days, renegotiate payment terms with customers and suppliers, are some of the options, but one of the most prominent for the possibilities it offers is the financing of accounts receivable."
    },
    {
        "stock": ["N2IU", "U14", "U96"],
        "title": "The 6 Best Ways for Solopreneurs to Manage their Books",
        "summary": "Even if you don't have a taste for accounting.",
        "content": "The following excerpt is from Money-Smart Solopreneur: A Personal Finance System for Freelancers, Entrepreneurs, and Side-Hustlers, out now via Entrepreneur Press. Purchase from Amazon | Barnes & Noble | Bookshop | IndieBound. Good record keeping is just good business. How you manage data, account for financial transactions and store and retrieve your records is part of running and maintaining your company. Use the following six tips for a more successful balancing act. 1. Separate business and personal data The line between personal and business finances can get blurry for solopreneurs. It’s important to separate the two, so you can easily monitor the progress of your business, plan for the future and create financial statements for specific periods, such as monthly or annually. Clear business records allow you to identify sources of income, tag tax-deductible expenses and easily prepare your taxes. Without a proper record-keeping system, tracking the details of your business and complying with the law may be close to impossible. For instance, if you don’t have a system to determine which restaurant meals or vehicle miles were personal and which were for business, you might be unable to claim valid business expenses as tax deductions. Related: Top Tips for Defining Your Solo Business Model 2. Use a business bank account To keep your business and personal finances completely separate, open a dedicated business bank account. If your business is incorporated (such as an S corp or LLC), you must have separate accounts to legally distinguish your business and personal finances. Remember that the purpose of incorporating is to create an entirely separate entity from yourself. You’ll need a separate business bank account where you can deposit checks made payable to your business. If your business name is the same as your personal name, you could likely cash business checks or deposit them into your personal account. And regardless of your business-entity type or name, you can pay business bills and expenses from a personal checking account and still claim them as a business-tax deduction. But these actions certainly muddy up your financial waters. So even if you could avoid having a business bank account, it’s still a good idea to establish one."
    },
    {
        "stock": ["V03", "O39", "H78"],
        "title": "4 Reasons Why You Shouldn't Delegate Your Company's Finances",
        "summary": "Don't forget about the numbers while your busy leading sales and marketing efforts.",
        "content": "As an entrepreneur, you start your new business with hopes and dreams. You nurture your business, you want it to be successful, you have lofty goals and you do everything you can to achieve them. You swear you’ll be the best. But do you know your business numbers? Because business is all about numbers. More to the point, have you considered what happens when you make business decisions without knowing how it will impact your bottom line? Do not go into business blindly. You need to understand how your decisions affect the profitability of your business. The reason entrepreneurs go into business is to make money, so if you are not tracking the money you are making, or even know whether your business is generating a profit, it defeats the purpose of being in business. Here are four reasons why you need to familiarize yourself with your company's finances. Related: 7 Tips to Hit 7 Figures in 2020 and Beyond 1. You can create a financial plan Having a financial plan is important because it gives your business direction. You can set goals such as revenue targets and monitor your progress against these goals throughout the year. You can also set profit margin goals to ensure the profitability of your business. You’ll want to do this to ensure the expenses in your business aren’t so inflated that you aren’t making any profit. 2. You can identify issues before they become bigger problems When you monitor your business throughout the year you can see issues forming that can potentially become bigger problems and cost you a lot of money. But, because you are monitoring your numbers, and you know your numbers, you will see this issue before it becomes a huge money suck and make adjustments to course correct. This actually ends up saving you a lot of money as you prevented a financial loss from occurring. The U.S. Small Business Administration states, “Looking closely at money-in and money-out helps maintain a sustainable balance between profit and loss.” 3. You can understand how each decision you make as a business owner affects your bottom line Because you understand your business numbers, you will have a solid understanding of how your business decisions will affect the profitability of your business. You can make confident business decisions knowing that these decisions will increase the profit line in your business. Related: 3 Reasons Why You Should Always Know the Financial Health of Your Business 4. You can stay in business for the long term One of the main reasons businesses close their doors is due to a lack of profitability. Don’t let that be your business. When you are the CEO of your business, you are likely taking on the roles of many because you can’t afford to hire all the professionals. You’re likely the sales manager, marketer, operations manager, customer relations . but don’t forget to include the finance manager in those roles. Investing in this skill now will not only pay off now but will carry your business into the growth stage, and when you can afford to hire financial help, you will always need to be involved in the numbers and decision making."
    },
    {
        "stock": ["BN4", "BS6", "C09", "C38U", "C52", "C61U"],
        "title": "How much should I save for my retirement ?: Infographic",
        "summary": "You should not think of a percentage of your salary, but of a specific figure for your retirement.",
        "content": "Having a decent pension is the great challenge for present and future generations. So you can calculate how much you should save monthly for your retirement."
    },
    {
        "stock": ["Z74", "Y92", "V03", "U96"],
        "title": "How to Make Money When You Can't Leave Your House",
        "summary": "Looking for out-of-the-box ways to make some extra cash right now? Try out these 30 strategies.",
        "content": "It wasn’t that long ago that working from home was merely a pipe dream. But throughout history, there has always been some type of “working from home.” Of course, today, working from home with ease has been with a big thanks to advancements in technology. The work from home requirements have become a necessity in a pandemic where you can’t leave your house. Maybe in the past you have worked from home because you can’t afford childcare, have a medical condition or you may be introverted and just prefer to stay at home. But, today, you are complying with stay-at-home orders due to Covid-19. Regardless of the reason you've worked from home, there are plenty of ways you can still make money, such as the following 30 ways. Related: 50 Work-From-Home Jobs Paying as Much or a Lot More Than the Average American Salary 1. Get paid for your opinions. Will taking online surveys make you rich? Nope. In most cases, the payout only ranges between $0.50 to $3 per survey, But, it’s an easy way to make some extra money, usually in the form of points that can be redeemed for gift cards, whenever you have some downtime. Some of the most well-known sites are Swagbucks, Survey Junkie and InboxDollar. You could also look into American Consumer Opinion and Opinion Outpost. You can make a little more money by participating in online focus groups or testing products at home. The additional upside is that you have the potential to make a couple of hundred bucks each month. Check out User Interviews, FocusGroup.com or Respondent.io. 2. Test websites. Typically, you can earn between $5 to $20 per hour testing websites. However, there is a possibility to make as much as $60 per hour. Best of all? You don’t need to possess any advanced technical skills to do this. You’re getting paid for your feedback on the design, functionality and layout of a website. UserTesting, Enroll, TestingTime and are some of the places where you can find this side gig."
    },
    {
        "stock": ["S58", "S63", "S68"],
        "title": "This is How Fintech Ensures Equal Access to Finance",
        "summary": "Proliferation of cryptocurrencies has led to development of a whole plethora of projects and full-fledged ecosystems, whose goal is to ensure easy access to financial products",
        "content": "Access to financial services is one of the most pressing issues of the modern days. In theory, the modern financial system provides a lot of opportunities and financial services, such as bank accounts, savings, credit, investment products, etc, but in reality larger populace of even most countries do not have access even to the very basic financial services. Investment is even worse in terms of accessibility. Traditional finance, unfortunately, can do very little to solve this issue. For example, in the United Kingdom, financial inclusivity is one of the main priorities for the House of Commons Treasury Committee, but in its annual reports the committee admits that the existing situation is not really improving. Regulatory and banks interests don’t allow much to be done outside of direct government sponsorship of very limited programs.  Obviously, such programs are only a palliative solution. In developing countries the situation is even worse. For example, in Egypt, less than half of registered companies actually work with the banks. Additionally, in developing countries local banks charge much higher interest due to unstable economic output and access to credit is restricted unduly to mitigate any losses on the local financial institutions. Large banks in developed countries are also unavailable for developing countries residents—partly due to local government policies, partly due to banks’ rules. This is where fintech tries to help.  Seeing these gaps in the financial services industry, providing wider access to financial services became the focus of the fintech industry. Proliferation of cryptocurrencies led to development of a whole plethora of projects and full-fledged ecosystems, whose goal was to ensure easy access to financial products. Money transfers, lending platforms, even investment opportunities—blockchain and cryptocurrency made all of it available for everyone. Cryptocurrency solves a lot of problems with financial inclusivity. There are virtually no geographical restrictions—residents of Egypt and Switzerland can use cryptocurrency on equal terms, transactions are much cheaper and even though the regulatory space is growing on this field, there is no intermediation from disinterested third parties (i.e. banks) to charge fee, make arbitrary judgment, and restrict access to capital.  But it comes with its fair share of problems. Lack of regulation is beneficial for accessibility, but it made crypto a safe haven for scammers and fraudsters. About 80 per cent of all Initial Coin Offerings (ICOs) turned out to be scam. Switching to IEO made crypto investments safer, but the landscape is evolving still. Cryptoassets are extremely volatile, so there is a huge risk of losing your savings turned into tokens or coins. Most blockchain projects are extremely focused on a single type of financial services, be it lending, trading or investments. Even the most developed fintech ecosystems offer very limited sets of related services. For example, Binance offers crypto exchange services, lending for traders and some investments options. So in order to get access to a full spectrum of financial services, users have to switch between multiple platforms and multiple cryptocurrencies, losing money on service fees and exchange fees. Is there a comprehensive solution? Fintech, as it relates to financial inclusivity, is advancing at rapid rates. The industry is maturing and better solutions are bound to appear in the market. Today, one of the most promising of these developments is the Nimbus platform. Nimbus is a unique platform that offers a full spectrum of financial services—from lending to bridging to a plethora of investment products. However, most of these products are still being developed. Most services offered are quite standard for today’s blockchain market—wallet with built-in coin tracker, exchange that has both centralized and P2P segments and social trading platform, crypto lending platforms. However, currently Nimbus is the only fintech platform that allows at-risk-arbitrage of digital assets in open architecture and a P2P exchange platform. Waseem Mamlouk, senior financial technology analyst, Nimbus says “It is critical to provide these (DeFi) services to the 2 billion unbanked citizens of the world who do not have access to a traditional bank and no accounts for cross border transactions. They need a secure platform for peer to peer lending and crowdfunding as well. By cutting out the traditional bankers, fees are reduced by literally 99 per cent and time to close the transaction goes from days to hours. Automation via smart contracts and Fintech Dapps will usher in the coming paradigm shift and Nimbus is well positioned to play a vital role with capable and experienced staff and a time tested platform”. The central Nimbus feature, IPO Hub is scheduled for Q2 2021, but it shows much promise already. The price of entry into IPO investments is quite high, so this financial product is only available to large institutional investors. Some brokers have already managed to lower the threshold of entry into the IPO to five thousand dollars. But this amount is still too high for an ordinary market participant. Nimbus IPO Hub will be the first platform that allows ordinary users to buy IPO stocks of large companies and become retail investors, which is phase II and III of the company’s product development. In this case, the minimum amount to buy is available to everyone and this is achieved through issuance of stablecoins (backed by USD). So, IPO entry threshold won’t be a problem for users as they will buy NSC tokens and invest them through Nimbus in the IPO that’s available. Nimbus will take over from here—exchange NSC for fiat money, buy shares, exchange profit for NSC and return NSC to users with profit. A special cluster of private blockchain servers will provide data integrity and protection and will ensure that all Nimbus users will get their return from investments. IPO Hub isn’t the only fintech product on the Nimbus platform. There is also social trading platform as well as a marketplace for financial products, such as stocks, ETFs, cryptocurrencies, IPO stocks, REIT, etc. in phase II and III of the company’s development. “The coming steps toward taking this enterprise to the next level will be exciting and surprising to the marketplace, which has not yet seen such a complete player with the needed components to handle end to end DeFi banking services at a highly professional level with the needed assurance for institutional grade service delivery,” adds Mamlouk. Basically, Nimbus will combine all essential financial services, from banks to funds on a single platform that allows access and participation in the global financial markets. Will Nimbus erase the problem of access to finance? Probably not. The problem is too comprehensive and large for any single project to solve on its own, but it is certainly a step in the right direction for the fintech industry."
    }
]